{
  "Random Body/Gross Stuff": [
    "What's the weirdest thing you've ever found in your belly button?",
    "If you had to eat one of your boogers right now, would you pick a crusty one or a gooey one?",
    "What's the longest you've gone without washing your hair and why?",
    "Have you ever peed in a swimming pool as an adult?",
    "What's the grossest thing you've ever done when you thought nobody was watching?",
    "If you could only use your tongue or your nose for the rest of your life, which would you choose?",
    "What's the weirdest place you've ever had a pimple?",
    "Have you ever tasted your own earwax? Be honest.",
    "What's the most embarrassing bodily function that's happened to you in public?",
    "If aliens examined your body, what would be the most confusing thing they'd find?"
  ],
  
  "Bizarre Hypotheticals": [
    "If you had to get a face tattoo of a vegetable, which vegetable and where?",
    "You wake up tomorrow and gravity only affects you half as much - what's the first thing you do?",
    "If you could only communicate through interpretive dance for a week, what would be the hardest thing to explain?",
    "You're suddenly 3 feet tall but keep your adult mind - how do you convince people you're not actually a child?",
    "If every time you sneezed, a random animal appeared, would you try to sneeze more or less?",
    "You can teleport anywhere, but you arrive completely naked every time - still worth it?",
    "If you had to replace your hands with any kitchen utensil, what would you choose?",
    "You're given the power to make one thing completely edible that isn't normally - what do you choose?",
    "If you could only move by hopping on one foot for the rest of your life, which foot would you choose?",
    "You have to live in a world where everyone constantly narrates their actions out loud - could you handle it?"
  ],
  
  "Weird Personal Stuff": [
    "What's the weirdest thing you believed about relationships before you were in one?",
    "Have you ever practiced kissing on your hand or a pillow?",
    "What's the most embarrassing thing in your search history?",
    "What's a weird habit you have that you think nobody notices?",
    "What's the strangest thing you've ever been genuinely afraid of?",
    "Have you ever talked to yourself in the mirror and what did you say?",
    "What's the weirdest dream you remember having about someone you know?",
    "What's something you do when you're alone that you'd never do in front of others?",
    "What's the most ridiculous thing you've ever been jealous of?",
    "Have you ever pretended to know about something you knew nothing about to impress someone?"
  ],
  
  "Off-the-Wall Scenarios": [
    "You're trapped in an elevator with a mariachi band - what song do you request?",
    "You have to spend 24 hours in a Chuck E. Cheese - what's your survival strategy?",
    "A wizard appears and offers to make you the world's best at something completely useless - what do you choose?",
    "You're stuck in a time loop reliving the most boring day of your life - how do you make it interesting?",
    "You have to give a TED talk about something you know nothing about in 10 minutes - what's your topic?",
    "You're the last person on Earth but all the WiFi still works - what do you do first?",
    "You have to plan a wedding for two squirrels with a $50 budget - describe the ceremony",
    "You're appointed as the mayor of a town full of cats - what's your first executive order?",
    "You have to survive a zombie apocalypse but your only weapon is a pool noodle - what's your plan?",
    "You wake up and everyone speaks in rhyme - how long before you go insane?"
  ],
  
  "Strange Childhood Beliefs": [
    "What's the weirdest thing you believed about how babies were made?",
    "Did you ever think something ridiculous about how your body worked?",
    "What's a completely wrong 'fact' you believed until embarrassingly recently?",
    "Did you have any weird theories about what adults did for fun?",
    "What's something you thought was normal in your family but realized was weird later?",
    "Did you ever believe in a made-up creature or monster that wasn't real?",
    "What's the strangest rule you thought existed that absolutely doesn't?",
    "Did you have any bizarre misunderstandings about how technology worked?",
    "What's something you thought would be a bigger part of adult life that totally isn't?",
    "Did you ever have a completely wrong idea about what a job involved?"
  ],
  
  "Embarrassing Situations": [
    "What's the most embarrassing thing that's happened to you in front of a crush?",
    "Have you ever waved back at someone who wasn't waving at you?",
    "What's the worst case of mistaken identity you've experienced?",
    "Have you ever pretended to recognize someone you had no idea who they were?",
    "What's the most embarrassing autocorrect fail you've sent?",
    "Have you ever walked into a glass door or window in front of people?",
    "What's the most awkward situation you've created by mishearing someone?",
    "Have you ever called a teacher 'mom' or 'dad' as an adult?",
    "What's the most embarrassing thing you've done while trying to look cool?",
    "Have you ever gotten caught doing something weird when you thought you were alone?"
  ],
  
  "Ridiculous Would You Rather": [
    "Would you rather fight one horse-sized duck or 100 duck-sized horses?",
    "Would you rather have fingers as long as legs or legs as short as fingers?",
    "Would you rather sweat mayonnaise or cry ranch dressing?",
    "Would you rather have a rewind button for your life or a pause button?",
    "Would you rather be able to speak to animals but they're all incredibly rude, or speak to plants but they only complain?",
    "Would you rather have your thoughts appear as subtitles above your head or have a laugh track play every time you make a joke?",
    "Would you rather only be able to whisper or only be able to shout for the rest of your life?",
    "Would you rather have taste buds in your stomach or in your fingertips?",
    "Would you rather have to sing everything you say or dance everywhere you go?",
    "Would you rather be followed by a personal narrator or have your own theme music that plays wherever you go?"
  ]
}
